package com.rabbiter.common;

import java.util.*;

public class Constant {

    public static Map<String, String> COMPANY_INFO;
    static {
        Map<String, String> map = new HashMap<>();
        map.put("上海画滕网络科技有限公司", "画滕短剧");
        map.put("上海画滕网络科技有限公司深圳分公司", "画滕短剧");
        map.put("上海见田信息科技有限公司", "见田短剧");
        map.put("上海见田信息科技有限公司深圳分公司", "见田短剧");
        map.put("海口龙华迦浩达网络科技工作室", "迦浩达短剧");
        map.put("海口龙华霖芮依网络科技工作室", "霖芮依短剧");
        map.put("海口龙华浩纪楠网络科技工作室", "浩纪楠短剧");
        map.put("海口龙华涵媛沁网络科技工作室", "涵媛沁短剧");
        map.put("西咸新区空港新城航锐拓网络工作室", "航锐拓短剧");
        map.put("西咸新区空港新城尚启玉网络工作室", "尚启玉短剧");
        map.put("西咸新区空港新城立腾旺网络工作室", "立腾旺短剧");
        map.put("西咸新区空港新城风铭蓝网络工作室", "风铭蓝短剧");
        map.put("西咸新区空港新城集弘博网络工作室", "集弘博短剧");
        map.put("西咸新区空港新城诚瑞星网络工作室", "诚瑞星短剧");
        map.put("西咸新区空港新城庆锐景网络工作室", "庆锐景短剧");
        map.put("西咸新区空港新城天奇迪网络工作室", "天奇迪短剧");
        map.put("西咸新区空港新城禾海畅网络工作室", "禾海畅短剧");
        map.put("西咸新区空港新城联弘吉网络工作室", "联弘吉短剧");
        map.put("蔚县贤蝶网络科技部", "贤蝶短剧");
        map.put("蔚县贤杰网络科技部", "贤杰短剧");
        map.put("蔚县鑫辉网络科技部", "鑫辉短剧");
        map.put("蔚县鑫若网络科技部", "鑫若短剧");
        map.put("蔚县鑫莲网络科技部", "鑫莲短剧");
        map.put("蔚县婧坤网络科技部", "婧坤短剧");
        map.put("蔚县鑫尹网络科技部", "鑫尹短剧");
        map.put("蔚县婧畅网络科技部", "婧畅短剧");
        map.put("蔚县婧华网络科技部", "婧华短剧");
        map.put("海口龙华涵惜鸠网络科技工作室", "涵惜鸠短剧");
        map.put("深圳众天网络科技有限公司", "众天短剧");
        map.put("上海风辑网络科技有限公司", "风辑短剧");
        map.put("蔚县贤颖网络科技部", "贤颖短剧");
        map.put("永安市爱二长网络科技工作室", "爱二长短剧");
        map.put("永安市在河网络科技工作室", "在河短剧科");
        map.put("永安市张宕网络科技工作室", "张宕短剧");
        map.put("永安市裴北网络科技工作室", "裴北短剧");
        map.put("永安市字迎网络科技工作室", "字迎短剧");
        map.put("永安市蔺材网络科技工作室", "蔺材短剧");
        map.put("永安市第燎网络科技工作室", "第燎短剧");
        map.put("永安市磨曦网络科技工作室", "磨曦短剧");
        map.put("永安市资盈网络科技工作室", "资盈短剧");
        map.put("永安市谭若网络科技工作室", "谭若短剧");
        map.put("铁岭县梵婧网络科技工作室", "梵婧短剧");
        map.put("铁岭县米果网络科技工作室", "米果短剧");
        map.put("铁岭县加奇网络科技工作室", "加奇短剧");
        map.put("铁岭县怡阳网络科技工作室", "怡阳短剧");
        map.put("铁岭县铭意网络科技工作室", "铭意短剧");
        map.put("铁岭县曼易网络科技工作室", "曼易短剧");
        map.put("铁岭县维宜网络科技工作室", "维宜短剧");
        map.put("铁岭县容叶网络科技工作室", "容叶短剧");
        map.put("铁岭县艺柏网络科技工作室", "艺柏短剧");
        map.put("铁岭县莎莎网络科技工作室", "莎莎短剧");
        map.put("武汉市江岸区本为网络科技工作室", "本为短剧");
        map.put("武汉市洪山区途佰网络科技工作室", "途佰短剧");
        map.put("武汉市江夏区康禾网络科技工作室", "康禾短剧");
        map.put("武汉市洪山区海盈网络科技工作室", "海盈短剧");
        map.put("武汉市洪山区金唯网络科技工作室", "金唯短剧");
        map.put("武汉市洪山区壹号网络科技工作室", "壹号短剧");
        map.put("武汉市洪山区厄尔网络科技工作室", "厄尔短剧");
        map.put("武汉市洪山区天野网络科技工作室", "天野短剧");
        map.put("天津市和平区偌菊网络科技工作室", "偌菊短剧");
        map.put("天津市河东区云敏网络科技工作室", "云敏短剧");
        map.put("天津市南开区彩艺网络科技工作室", "彩艺短剧");
        map.put("武汉市青山区斯林网络科技工作室", "斯林短剧");
        map.put("沈阳市于洪区姜融网络科技工作室", "姜融短剧");
        map.put("沈阳市于洪区榕望网络科技工作室", "榕望短剧");
        map.put("沈阳市于洪区旺融网络科技工作室", "旺融短剧");
        map.put("沈阳市于洪区佳蓉网络科技工作室", "佳蓉短剧");
        map.put("沈阳市于洪区荣房网络科技工作室", "荣房短剧");
        map.put("天津市西青区迪落网络科技工作室", "迪落短剧");
        map.put("天津市和平区恰娱网络科技工作室", "恰娱短剧");
        map.put("天津市西青区柏恰网络科技工作室", "柏恰短剧");
        map.put("天津市和平区彤落网络科技工作室", "彤落短剧");
        map.put("天津市和平区绮罗网络科技工作室", "绮罗短剧");
        map.put("天津市河东区蕊落网络科技工作室", "蕊落短剧");
        map.put("天津市和平区楠莉萍网络科技工作室", "楠莉萍短剧");
        map.put("天津市和平区露青曦网络科技工作室", "露青曦短剧");
        map.put("天津市和平区悦露离网络科技工作室", "悦露离短剧");
        map.put("天津市和平区亦逸兴网络科技工作室", "亦逸兴短剧");
        map.put("天津市和平区月希柏网络科技工作室", "月希柏短剧");
        map.put("天津市和平区蓉落黎网络科技工作室", "蓉落黎短剧");
        map.put("天津市河东区筠落荷网络科技工作室", "筠落荷短剧");
        map.put("天津市西青区璐瑶希网络科技工作室", "璐瑶希短剧");
        map.put("天津市西青区谷雨黎网络科技工作室", "谷雨黎短剧");
        map.put("天津市西青区雨柏溪网络科技工作室", "雨柏溪短剧");
        map.put("天津市西青区风落离网络科技工作室", "风落离短剧");
        map.put("武汉市青山区菲尔格网络科技工作室", "菲尔格短剧");
        map.put("天津市和平区益露芯网络科技工作室", "益露芯短剧");
        map.put("天津市西青区华彩希网络科技工作室", "华彩希短剧");
        map.put("天津市河北区卓越离网络科技工作室", "卓越离短剧");
        map.put("天津市河北区星络语网络科技工作室", "星络语短剧");
        map.put("天津市和平区宝落离网络科技工作室", "宝落离短剧");
        map.put("天津市和平区荣盛西网络科技工作室", "荣盛西短剧");
        map.put("天津市西青区念易瑞网络科技工作室", "念易瑞短剧");
        map.put("天津市南开区润德希网络科技工作室", "润德希短剧");
        map.put("天津市和平区韵希离网络科技工作室", "韵希离短剧");
        map.put("天津市和平区星语轩网络科技工作室", "星语轩短剧");
        map.put("天津市河东区恒恰古网络科技工作室", "恒恰古短剧");
        map.put("天津市河东区月息离网络科技工作室", "月息离短剧");
        map.put("天津市南开区露希离网络科技工作室", "露希离短剧");
        map.put("天津市西青区离诺西网络科技工作室", "离诺西短剧");
        map.put("湖南湘江新区仓冲听网络工作室", "仓冲听短剧");
        map.put("湖南湘江新区农换桨网络工作室", "农换桨短剧");
        map.put("湖南湘江新区造姿朱网络工作室", "造姿朱短剧");
        map.put("湖南湘江新区亭欢衫网络工作室", "亭欢衫短剧");
        map.put("湖南湘江新区刘创连网络工作室", "刘创连短剧");
        map.put("天津市和平区梓络网络科技工作室", "梓络短剧");
        COMPANY_INFO = Collections.unmodifiableMap(map);
    }

    public static final List<String> SELLING_POINTS_LIST = Collections.unmodifiableList(Arrays.asList(
            "畅享海量免费短剧",
            "人气短剧随心观看",
            "热播短剧精彩连连",
            "热门短剧无限选择",
            "爆点短剧精彩纷呈",
            "经典短剧海量更新",
            "热门短剧随心畅享",
            "精彩短剧不容错过",
            "精彩短剧海量推荐",
            "热播短剧随心畅观"
//            "热播短剧尽情追看",
//            "超虐心催泪短剧",
//            "好评滔滔的短剧",
//            "眾誉喧天的短剧",
//            "引无数掌声的短剧",
//            "震撼口碑的短剧",
//            "赞誉如潮的短剧",
//            "众口一词推崇的短剧"
    ));

    public static final List<String> CALL_TO_ACTION_LIST = Collections.unmodifiableList(Arrays.asList(
            "点击观看",
            "观看全集",
            "更多精彩",
//            "精彩内容",
            "立即追剧",
            "更多详情",
            "点击观赏",
            "马上看剧",
            "点击追剧",
            "点击观剧",
            "点击查看"));

    public static final Map<String, Map<String, String>> BID_STRATEGY_MAP = new LinkedHashMap() {
        {
            put("张宕短剧", new LinkedHashMap() {
                {

                    put("抖超小39", "3.5&1.2&100&");
                    put("抖超小99", "9&1.2&200&");
                    put("抖小额", "30&1.2&300&");
                    put("抖大额", "106&1.2&500&");
                }
            });
            put("字迎短剧", new LinkedHashMap() {
                {

                    put("抖超小39", "3.5&1.15&100&");
                    put("抖超小99", "8&1.15&200&");
                    put("抖小额", "30&1.2&300&");
                    put("抖大额", "106&1.2&500&");
                }
            });
            put("思林短剧", new LinkedHashMap() {
                {

                    put("抖超小39", "3.5&1.2&100&");
                    put("抖超小99", "8&1.2&200&");
                    put("抖小额", "30&1.2&300&");
                    put("抖大额", "106&1.2&500&");
                }
            });
            put("见田短剧", new LinkedHashMap() {
                {

                    put("抖超小29", "3.5&1.2&100&7501273705260105779&1830432400447060");
                    put("抖超小10", "9&1.2&200&7501273705260105779&1830432400447060");
                    put("抖小额", "31&1.2&300&7501272553101508646&1830368627597891");
                    put("抖大额", "105.88&1.2&500&7501272553101508646&1830368627597891");
                }
            });
            put("风铭蓝短剧", new LinkedHashMap() {
                {
                    put("超小", "3.88&1.2&100&7504212640424558643&1832081740886475");
                    put("低", "14&1.2&100&7504212640424558643&1832081740886475");
                    put("ROI", "0&0.75&200&7504212640424558643&1832081740886475");
                }
            });
        }
    };

    public static final List<String> TITLE_LIST = Collections.unmodifiableList(Arrays.asList(
            "偷偷告诉你！我昨天晚上看了这部短剧，一夜没睡",
            "不能再靠近看这部剧了，因为再多靠近一点看就会融化",
            "这部短剧有毒，熬夜看完，一个字爽！",
            "一部被低估的短剧，两个字评价：精彩！精彩！还是精彩！",
            "导演真敢拍，这部短剧太过瘾了，让你停不下来！",
            "别再找了，这才是你想看的短剧，内容精彩，不看后悔系列",
            "什么是真正的以牙还牙？第六集实在是太爽了！",
            "熬夜都要看的爽剧，全程高能开挂逆袭，一口气看到大结局!",
            "看了三分钟就陷进去，太紧凑了，真的以牙还牙，爽翻天!",
            "终于找到这部短剧了，一口气追到大结局，超过瘾！",
            "后悔看的太快，年度爆款出圈短剧，强烈推荐！",
            "这部短剧神作，打脸一波儿接着一波儿，全程高能反转，力荐！",
            "求求了！导演会拍就多拍点吧,这短剧也太绝了吧",
            "千万不要熬夜看的爽剧，全程高能开挂逆袭，怕你一口气看到大结局",
            "一天狂看7次，谁能顶得住这部短剧？特别是第八集...",
            "这部短剧太爽了，尤其是第三集，太过瘾，看了几百遍还想看！",
            "全程高能反转，一波接着一波，劲爆力荐短剧！",
            "熬夜都要看的爽剧，全程高能开挂逆袭，一口气看到大结局",
            "超过瘾的短视频，看了还想看，熬夜也想看完，精彩",
            "很久没看到过这么精彩的剧了，后悔没有早点看",
            "开场紧张感十足，中间各种解气吊打，结局更是爽！",
            "熬夜都要看的爽剧，全程高能开挂逆袭，一口气看到大结局!",
            "看5分钟就陷进去了，太紧凑了，这部短剧熬夜也要看",
            "150集已完结都市赘婿短剧，8万人评出9.8分，一直看到大结局",
            "高质量短剧来袭，看了女主也太上头了吧，尤其是第7集",
            "这部短剧有毒，五分钟入迷，点击继续观看完整版！",
            "看了第一集，想看第二集，看了第二三集",
            "完了，看了这部剧根本停不下来，每晚都想看，太爽了！",
            "这才是真爽剧，逆袭打脸，点击就看",
            "这部剧太好看了，才知道内容是这么精彩！",
            "上班族千万要看，特别是第十集，让人越看越上头",
            "劝你一定要看第十集，真正的以牙还牙，一口气看完爽翻天!",
            "新鲜出炉的热播剧，身边的朋友都在追！实在是太爽了",
            "热门短剧正在热播中，点击可继续观看完整剧情！",
            "火爆现言总裁完结短剧，不近女色的白切黑追妻之路，超级甜！",
            "通宵一晚终于看完这部剧了，35岁以上的人不看后悔！",
            "导演真敢拍，这部短剧太过瘾了，让你停不下来！",
            "可以追一晚上的剧，凌晨五点了还没睡",
            "哇！新剧上线了！好看又上头，几百款短剧任你挑！进来瞧瞧",
            "这部剧看了一晚上，根本停不下来，好看精彩！",
            "记得一个人观看，尤其是第三集让人疯狂，怕你停不下来",
            "新鲜出炉的热播剧，身边的朋友都在追！实在是太爽了！",
            "一口气看完100集，这部短剧让我欲犹未尽，真好看！",
            "别再找了，这才是你想看的短剧，内容精彩，不看后悔系列",
            "看了第一集，想看第二集，打脸一波接着一波，力荐",
            "一定要看第十集，真的以牙还牙，爽翻天!",
            "这部剧真的很顶！没人能忍住不看，看完前几集，根本停不下来！",
            "现在的短剧都这么卷了吗，第十二集真的是看点十足",
            "一直看到大结局！这部短剧的内容太精彩了，看完还想看！",
            "看了第一集，想看第二集，看了第二三集，想一直看下去的短剧！"));

}
